const constants = () => {
  const phoneFormats = {
    "+998": /^\d{2}\s\d{3}-\d{2}-\d{2}$/, // Узбекистан
    "+996": /^\d{3}\s\d{3}-\d{3}$/, // Киргизия
    "+992": /^\d{2}\s\d{3}-\d{2}-\d{2}$/, // Таджикистан
    "+993": /^\d{1}\s\d{3}-\d{2}-\d{2}$/, // Туркменистан
    "+7": /^\d{3}\s\d{3}-\d{2}-\d{2}$/, // Россия и Казахстан
    "+375": /^\d{2}\s\d{3}-\d{2}-\d{2}$/, // Беларусь
  };

  const phonePlaceholders = {
    "+998": "(__)___-__-__", // Узбекистан
    "+996": "___-___-___", // Киргизия
    "+992": "(__)___-__-__", // Таджикистан
    "+993": "(__)___-__-__", // Туркменистан
    "+7": "___-___-__-__", // Россия и Казахстан
    "+375": "(__)___-__-__", // Беларусь
  };

  return {
    phoneFormats,
    phonePlaceholders,
  };
};

export default constants;
